from functional_tests.base import FunctionalTest


class GuidesTest(FunctionalTest):
    """тесты Руководств"""

    def test_can_create_new_guide(self) -> None:
        """тест можно создать новое руководство"""
        # Гал хочет создать свое первое Руководство.
        # Он зарегестрированный и залогиненый пользователь
        # todo: реализовать вход в тесте с помощью cookies

        # Он открывает главную страниуц

        # Находит кнопку добавления нового руководства

        # Нажимает на нее

        # Попадает на страницу создания нового Руководства

        # Где он может ввести название руководства

        # Описание руководства

        # Обложку руководства

        # Он заполняет соответствующие поля

        # Устатавливает фон



